export interface Word {
    value: string,
    hint: string,
}

export interface Char {
    value: string,
    isVisible: boolean,
}

export const words: Word[] = [
    { value: "КОРАБЛЬ", hint: "Водный транспорт, используемый для перевозки людей и грузов" },
    { value: "КАРТИНА", hint: "Искусство, созданное художником на холсте с красками" },
    { value: "СОЛНЦЕ", hint: "Центральная звезда в солнечной системе, источник света и тепла" },
    { value: "ПЕНАЛ", hint: "Контейнер для канцелярских принадлежностей, таких как карандаши, ручки и ластик" },
    { value: "КОТЕНОК", hint: "Молодой кот, обычно милый и игривый" },
    { value: "МОЛОКО", hint: "Питательный продукт, производимый животными, такими как коровы и козы" },
    { value: "ПАРК", hint: "Публичное место для отдыха и прогулок, обычно с деревьями и скамейками" },
    { value: "ШАРФ", hint: "Длинная полоса ткани, обычно носимая вокруг шеи для согрева" },
    { value: "ТЕЛЕФОН", hint: "Электронное устройство для связи и разговоров" },
    { value: "ДОМИК", hint: "Маленький дом, часто использованный для отдыха или игры" },
    { value: "ЦВЕТОК", hint: "Растение с разноцветными лепестками, используемое для украшения" },
    { value: "ШОКОЛАД", hint: "Сладкое угощение, созданное из какао и сахара" },
    { value: "КЛЮЧ", hint: "Металлический предмет, используемый для открытия замков и дверей" },
    { value: "КОФЕ", hint: "Ароматный напиток, приготовленный из кофейных зерен" },
    { value: "КОЛЕСО", hint: "Круглый предмет, обычно вращающийся, используемый на машинах и велосипедах" },
    { value: "БИЛЕТ", hint: "Документ, позволяющий получить доступ или посещать различные события и мероприятия" },
    { value: "МЯЧ", hint: "Игрушка или спортивный снаряд, часто круглой формы" },
    { value: "СКРИПКА", hint: "Музыкальный инструмент с четырьмя струнами, играемый с помощью смычка" },
    { value: "АВТОБУС", hint: "Общественный транспорт, предназначенный для перевозки пассажиров по маршруту" },
    { value: "ЭКСКУРСИЯ", hint: "Путешествие с целью ознакомления с историческими или культурными достопримечательностями." },
    { value: "ПАРАДОКС", hint: "Логическое утверждение, противоречащее общепринятым правилам и логике." },
    { value: "ГРАВИТАЦИЯ", hint: "Сила, притягивающая все материальные объекты друг к другу." },
    { value: "КОНСТРУКЦИЯ", hint: "Процесс или результат создания сложной структуры или механизма." },
    { value: "МАРГИНАЛ", hint: "Человек, находящийся на общественной периферии, часто исключенный из основного потока." },
    { value: "АМБИВАЛЕНТНЫЙ", hint: "Имеющий двоякое значение или двусмысленный." },
    { value: "СУФФИКС", hint: "Морфема, добавляемая к корню слова, чтобы изменить его значение или грамматическую форму." },
    { value: "БИОЛОГИЯ", hint: "Наука, изучающая живые организмы и их взаимодействие с окружающей средой." },
    { value: "ИНДУЛЬГЕНЦИЯ", hint: "Придание прощения грехов или освобождение от наказания, часто в религиозном контексте." },
    { value: "СИНТЕЗИРОВАТЬ", hint: "Объединение различных элементов или компонентов для создания чего-то нового или более сложного." },
    { value: "ПАНДЕМИОЛОГ", hint: "Специалист, изучающий пандемии и их распространение." },
    { value: "ГИПОКОНДРИЯ", hint: "Психологическое состояние, характеризующееся чрезмерной беспокойством о своем здоровье." },
    { value: "ОПРОБИУМ", hint: "Критика и осуждение со стороны общества." },
    { value: "ПАРАЛЛАКС", hint: "Изменение позиции или угла наблюдения, влияющее на визуальное восприятие объектов." },
    { value: "ГЕНИАЛИЗМ", hint: "Творческий метод, характеризующийся оригинальным и гениальным подходом к решению проблем." },
    { value: "ИНТРИГАНТ", hint: "Человек, замешанный в интригах и заговорах." },
    { value: "РЕТРОСПЕКТИВ", hint: "Связанный с рассмотрением событий, прошедших в прошлом." },
    { value: "ПРОПАГАНДА", hint: "Систематическое распространение информации с целью воздействия на общественное мнение и убеждения." },
    { value: "ЭКЛЕКТИКА", hint: "Использование элементов из разных стилей, направлений и искусств в одном произведении." },
    { value: "МЕТАФОРА", hint: "Литературное устройство, использующее образное сравнение для передачи смысла." }

]